# Дан список чисел, отсортировать его по возрастанию
# без использования sort и sorted

n = 1

# while n < len(spisok):
#     for i in range(len(spisok)-n):
#         if spisok[i] > spisok[i+1]:
#             spisok[i], spisok[i+1] = spisok[i+1], spisok[i]
#     n += 1
print(n)

