# Без использования collections, написать программу, которая будет
# создавать словарь для подсчитывания количества вхождений каждой
# буквы в текст введенный с клавиатуры
text: str = input('введи слово: ')
letters: list = text.split()
print(letters)
