# Пользователь вводит число N с клавиатуры
# посчитать сумму чисел от 1 до N

# n:int = int(input('введи число '))
#
# mnoghestvo:list =[i for i in range(1, n+1)]
# print(mnoghestvo)
# print(sum(mnoghestvo))

# some_list = [1, 2, 31]
# del some_list[0]
# print(some_list)
# some_list = [1, 2, 31]
# some_list.remove(1)
# print(some_list)



